
Задание 5. В строке, которую вводит пользователь, определите количество слов,
добавьте в начало строки слово Start и в конец строки слово End

namespace ConsoleApp1;

public static class Program
{
    public static void Main(string[] args)
    {
        Console.WriteLine("Введите строку слов:");
        string? s = Console.ReadLine();
        int spaceCount = 0;
        
        for (int i = 0; i < s.Length; i++)
        {
            if (s[i] == ' ' && s[i] != '\0')
            {
                spaceCount++;
            }
        }
        
        Console.WriteLine($"В строке содержится {++spaceCount} слов(а).");
    }
}